v2206/Projects/mySolver_cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpeFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1; // 5e-3;

writeControl    adjustable;

writeInterval   5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  true;

runTimeModifiable true;

maxCo           0.4;

maxDeltaT       1;

functions {
    // yPlus1
    // {
    //     // Mandatory entries (unmodifiable)
    //     type            yPlus;
    //     libs            (fieldFunctionObjects);

    //     // Optional (inherited) entries
    //     writePrecision  10;
    //     writeToFile     true;
    //     useUserTime     true;

    //     region          region0;
    //     enabled         true;
    //     log             true;
    //     timeStart       0;
    //     timeEnd         1000;
    //     executeControl  timeStep;
    //     executeInterval 1;
    //     writeControl    writeTime;
    //     writeInterval   1;

    // }
}


// ************************************************************************* //
